let horizontalBlinds = [
  {
    "name": "Белые",
    "standard" : {
      "s25mm" : 5,
      "s16mm" : 9.7,
    },
    "venus" : {
       "v25mm" : {
        "standard" :  16,
        "fullDimmer" : 17,
       },
       "v16mm" : 19.5,
    }
  },
  {
    "name": "Цветные",
    "standard" : {
      "s25mm" : 7.2,
      "s16mm" : 10.5,
    },
    "venus" : {
       "v25mm" : {
        "standard" :  17.5,
        "fullDimmer" : 18.5,
       },
       "v16mm" : 21,
    }

  }

]




// альтернатвный вариант записи
// {
//     "name": "Цветные",
//     "standard_25mm" : 7.2,
//     "standard_16mm" : 10.5,
//     'venus_25mm_standard'  :  17.5,
//     'venus_25mm_full-dimmer'  :  18.5,
//     "venus_16mm" : 21

// }


// Белые   5,0 9,7 16,0  17,0  19,5
// Цветные   7,2 10,5  17,5  18,5  21,0
// Двухцветные, Комбинированные    7,3 11,0  18,5  18,5  22,0
// Перфорированные , Перламутровые, Мраморные 4020   12,0  - 22,0  23,0  -
// Ламинация под дерево    14,0  18,0  29,0  31,0  31,0
// Леопардовые   16,0  - 29,0  31,0  -
