let allGoods = {
  rollerBlinds :  [
     {
      "name": "Марсесль АКЦИЯ!!!",
      "openType" : {
        "copact" :[ 8.3  ,"+1", "Compact и фалш шторы"],
        "mini" :[ 9.3 ,"+1" , "MINI"],
        "standard" :[ 11.0 ,"+1" , "STANDART"],
        "maximus" : [17.0,  "" , "MAXIMUS"] 
      },
      "closedType" : {
         "uniFlat" : [17.0 , "+2" , "UNI Плоскю Направл"] ,
         "uniFullTurn" : [23.0 , "+3" , "UNI П-обрю Направл."],
      }
    },
    {
      "name": "LEN",
      "openType" : {
        "copact" : [9.3 , "+1", "Compact и фалш шторы" ],
        "mini" : [10.3 , "+1", "MINI"],
        "standard" :[ 12.0 , "+1" , "STANDART" ],
        "maximus" : [19.0, " ", "MAXIMUS"],
      },
      "closedType" : {
         "uniFlat" :[ 19.0 , "+2", "UNI Плоскю Направл" ],
         "uniFullTurn" : [25.0 , "+3" , "UNI П-обрю Направл."],
      }
    },
  ],

  rollerBlindsDayNight : [
     {
      "name": "Марсесль АКЦИЯ!!!",
      "openType" : {
        "copact" :[1  ,"+1", "Compact и фалш шторы"],
        "mini" :[ 2 ,"+1" , "MINI"],
        "standard" :[ 3 ,"+1" , "STANDART"],
        "maximus" : [4,  "" , "MAXIMUS"] 
      },
      "closedType" : {
         "uniFlat" : [5 , "+2" , "UNI Плоскю Направл"] ,
         "uniFullTurn" : [6, "+3" , "UNI П-обрю Направл."],
      }
    },
    {
      "name": "LEN",
      "openType" : {
        "copact" : [10 , "+1", "Compact и фалш шторы" ],
        "mini" : [20 , "+1", "MINI"],
        "standard" :[ 30 , "+1" , "STANDART" ],
        "maximus" : [40, " ", "MAXIMUS"],
      },
      "closedType" : {
         "uniFlat" :[ 50 , "+2", "UNI Плоскю Направл" ],
         "uniFullTurn" : [60 , "+3" , "UNI П-обрю Направл."],
      }
    },
  ],

  rollerBlindsReady : [
    {
      "name" : "LEN",
      "width" : {
        "w35" : [5.03,"", "35"],
        "w40" :[ 5.39,"", "40"],
        "w45" :[ 5.78,"", "45"],
        "w50" :[ 6.15,"", "50"],
        "w55" :[ 6.55,"", "55"],
        "w60" :[ 6.94,"", "60"],
        "w65" :[ 7.33,"", "65"],
        "w70" :[ 7.70,"", "70"],
        "w75" :[ 8.10,"", "75"],
        "w80" :[ 8.49,"", "80"],
        "w85" :[ 8.86,"", "85"],
        "w90" :[ 9.24,"", "90"],
        "w95" :[ 9.63,"", "95"],
        "w100" : [10.00,"", "100"],
        "w105" : [10.40,"", "105"],
        "w110" : [10.79,"", "110"],
        "w115" : [11.18,"", "115"],
        "w120" : [11.56,"", "120"],
        "w125" :[ 11.95,"", "125"],
        "w130" :[ 12.32,"", "130"],
      }
    },
    {
      "name" : "WODA, LAZUR, NARUTA",
      "width" : {
        "w35" : [5.03,"", "35"],
        "w40" :[ 5.39,"", "40"],
        "w45" :[ 5.78,"", "45"],
        "w50" :[ 6.15,"", "50"],
        "w55" :[ 6.55,"", "55"],
        "w60" :[ 6.94,"", "60"],
        "w65" :[ 7.33,"", "65"],
        "w70" :[ 7.70,"", "70"],
        "w75" :[ 8.10,"", "75"],
        "w80" :[ 8.49,"", "80"],
        "w85" :[ 8.86,"", "85"],
        "w90" :[ 9.24,"", "90"],
        "w95" :[ 9.63,"", "95"],
        "w100" : [10.00,"", "100"],
        "w105" : [10.40,"", "105"],
        "w110" : [10.79,"", "110"],
        "w115" : [11.18,"", "115"],
        "w120" : [11.56,"", "120"],
        "w125" :[ 11.95,"", "125"],
        "w130" :[ 12.32,"", "130"],
      }
    }

  ],

  // горизонтальные жалюзи

  horizontalHouverVenus : [
  {
    "name" : "Белые",
    "standard25mm" : [16.0  ,"", "25мм Стандарт"],
    "fullDimmer25mm" : [ 17.0 ,"", "25мм Полн. Затемн."],
    "standard16mm" :  [ 19.5,"",  "16мм Стандарт"],
  },
  {
    "name" : "Разноцветные",
    "standard25mm" : [17.5 ,"", "25мм Стандарт"],
    "fullDimmer25mm" : [18.5 ,"", "25мм Полн. Затемн."],
    "standard16mm" :  [21.0 ,"", "16мм Стандарт"],
  }
],

  horizontalHouverStandard : [
  {
    "name" : "Белые",
    "standard25mm" : [5.0  ,"", "25мм"],
    "standard16mm" :  [ 9.7,"",  "16мм"],
  },
  {
    "name" : "Разноцветные",
    "standard25mm" : [7.2 ,"", "25мм"],
    "standard16mm" :  [10.5 ,"", "16мм"],
  }
],

//вертикальные жалюзи

  verticalHouver127mm : [
  {
    "name" : "Gamma 1100",
    "colorСode" : ["" , "1100" , "" ],
    "price" : [5.9 , "", ""]
  },
   {
    "name" : "LINE",
    "colorСode" : ["" , "8001, 8002, 8003, 8004" , "" ],
    "price" : [6.4 , "", ""]
  },
],

verticalHouver89mm : [
  {
    "name" : "Line II 89",
    "colorСode" : ["" , "601, 602, 605" , "" ],
    "price" : [7.3 , "", ""]
  },
   {
    "name" : "Line 89",
    "colorСode" : ["" , "601" , "" ],
    "price" : [7.5 , "", ""]
  },
],

//Москитные сетки

 mosquitoNet : [
  {
    "name" : "Б-Белые, К-Коричневые, Д-Ламинация под дерево, А-Анодированые",
    "BK37" : [42.0 ,"", "37 Б / К"],
    "BK41" : [47.0,"",  "41 Б / К"],
    "DA37" : [66.0,"",  "37 Д / А"],
    "DA41" : [88.0,"",  "41 Д / А"]
  }
]




}