let allGoods = {
  rollerBlinds :  [
     {
      "name": "Марсесль АКЦИЯ!!!",
      "openType" : {
        "copact" :[ 8.3  ,"+1", "Compact и фалш шторы"],
        "mini" :[ 9.3 ,"+1" , "MINI"],
        "standard" :[ 11.0 ,"+1" , "STANDART"],
        "maximus" : [17.0,  "" , "MAXIMUS"] 
      },
      "closedType" : {
         "uniFlat" : [17.0 , "+2" , "UNI Плоскю Направл"] ,
         "uniFullTurn" : [23.0 , "+3" , "UNI П-обрю Направл."],
      }
    },
    {
      "name": "LEN",
      "openType" : {
        "copact" : [9.3 , "+1", "Compact и фалш шторы" ],
        "mini" : [10.3 , "+1", "MINI"],
        "standard" :[ 12.0 , "+1" , "STANDART" ],
        "maximus" : [19.0, " ", "MAXIMUS"],
      },
      "closedType" : {
         "uniFlat" :[ 19.0 , "+2", "UNI Плоскю Направл" ],
         "uniFullTurn" : [25.0 , "+3" , "UNI П-обрю Направл."],
      }
    },
    {
      "name": "MATTE",
      "openType" : {
        "copact" : [10.5, "+1", "Compact и фалш шторы" ],
        "mini" : [11.5 , "+1", "MINI"],
        "standard" :[ 13.0 , "+1" , "STANDART" ],
        "maximus" : [21.0, " ", "MAXIMUS"],
      },
      "closedType" : {
         "uniFlat" :[ 22.0 , "+2", "UNI Плоскю Направл" ],
         "uniFullTurn" : [28.0 , "+3" , "UNI П-обрю Направл."],
      }
    },
     {
      "name": "WODA",
      "openType" : {
        "copact" : [10.5, "+1", "Compact и фалш шторы" ],
        "mini" : [11.5 , "+1", "MINI"],
        "standard" :[ 13.0 , "+1" , "STANDART" ],
        "maximus" : [21.0, " ", "MAXIMUS"],
      },
      "closedType" : {
         "uniFlat" :[ 22.0 , "+2", "UNI Плоскю Направл" ],
         "uniFullTurn" : [28.0 , "+3" , "UNI П-обрю Направл."],
      }
    },
    {
      "name": "LAZUR",
      "openType" : {
        "copact" : [10.5, "+1", "Compact и фалш шторы" ],
        "mini" : [11.5 , "+1", "MINI"],
        "standard" :[ 13.0 , "+1" , "STANDART" ],
        "maximus" : [21.0, " ", "MAXIMUS"],
      },
      "closedType" : {
         "uniFlat" :[ 22.0 , "+2", "UNI Плоскю Направл" ],
         "uniFullTurn" : [28.0 , "+3" , "UNI П-обрю Направл."],
      }
    },
    {
      "name": "NATURA",
      "openType" : {
        "copact" : [10.5, "+1", "Compact и фалш шторы" ],
        "mini" : [11.5 , "+1", "MINI"],
        "standard" :[ 13.0 , "+1" , "STANDART" ],
        "maximus" : [21.0, " ", "MAXIMUS"],
      },
      "closedType" : {
         "uniFlat" :[ 22.0 , "+2", "UNI Плоскю Направл" ],
         "uniFullTurn" : [28.0 , "+3" , "UNI П-обрю Направл."],
      }
    },
    {
      "name": "TOPAZ",
      "openType" : {
        "copact" : [10.5, "+1", "Compact и фалш шторы" ],
        "mini" : [11.5 , "+1", "MINI"],
        "standard" :[ 13.0 , "+1" , "STANDART" ],
        "maximus" : [21.0, " ", "MAXIMUS"],
      },
      "closedType" : {
         "uniFlat" :[ 22.0 , "+2", "UNI Плоскю Направл" ],
         "uniFullTurn" : [28.0 , "+3" , "UNI П-обрю Направл."],
      }
    },
    {
      "name": "AKANT",
      "openType" : {
        "copact" : [10.5, "+1", "Compact и фалш шторы" ],
        "mini" : [11.5 , "+1", "MINI"],
        "standard" :[ 13.0 , "+1" , "STANDART" ],
        "maximus" : [21.0, " ", "MAXIMUS"],
      },
      "closedType" : {
         "uniFlat" :[ 22.0 , "+2", "UNI Плоскю Направл" ],
         "uniFullTurn" : [28.0 , "+3" , "UNI П-обрю Направл."],
      }
    },
  ],

  rollerBlindsDayNight : [
     {
      "name": "Марсесль АКЦИЯ!!!",
      "openType" : {
        "copact" :[1  ,"+1", "Compact и фалш шторы"],
        "mini" :[ 2 ,"+1" , "MINI"],
        "standard" :[ 3 ,"+1" , "STANDART"],
        "maximus" : [4,  "" , "MAXIMUS"] 
      },
      "closedType" : {
         "uniFlat" : [5 , "+2" , "UNI Плоскю Направл"] ,
         "uniFullTurn" : [6, "+3" , "UNI П-обрю Направл."],
      }
    },
   
  ],

  rollerBlindsReady : [
    {
      "name" : "LEN",
      "width" : {
        "w35" : [5.03,"", "35"],
        "w40" :[ 5.39,"", "40"],
        "w45" :[ 5.78,"", "45"],
        "w50" :[ 6.15,"", "50"],
        "w55" :[ 6.55,"", "55"],
        "w60" :[ 6.94,"", "60"],
        "w65" :[ 7.33,"", "65"],
        "w70" :[ 7.70,"", "70"],
        "w75" :[ 8.10,"", "75"],
        "w80" :[ 8.49,"", "80"],
        "w85" :[ 8.86,"", "85"],
        "w90" :[ 9.24,"", "90"],
        "w95" :[ 9.63,"", "95"],
        "w100" : [10.00,"", "100"],
        "w105" : [10.40,"", "105"],
        "w110" : [10.79,"", "110"],
        "w115" : [11.18,"", "115"],
        "w120" : [11.56,"", "120"],
        "w125" :[ 11.95,"", "125"],
        "w130" :[ 12.32,"", "130"],
      }
    },
    {
      "name" : "WODA",
      "width" : {
        "w35" : [5.03,"", "35"],
        "w40" :[ 5.39,"", "40"],
        "w45" :[ 5.78,"", "45"],
        "w50" :[ 6.15,"", "50"],
        "w55" :[ 6.55,"", "55"],
        "w60" :[ 6.94,"", "60"],
        "w65" :[ 7.33,"", "65"],
        "w70" :[ 7.70,"", "70"],
        "w75" :[ 8.10,"", "75"],
        "w80" :[ 8.49,"", "80"],
        "w85" :[ 8.86,"", "85"],
        "w90" :[ 9.24,"", "90"],
        "w95" :[ 9.63,"", "95"],
        "w100" : [10.00,"", "100"],
        "w105" : [10.40,"", "105"],
        "w110" : [10.79,"", "110"],
        "w115" : [11.18,"", "115"],
        "w120" : [11.56,"", "120"],
        "w125" :[ 11.95,"", "125"],
        "w130" :[ 12.32,"", "130"],
      }
    },
    {
      "name" : "LAZUR",
      "width" : {
        "w35" : [5.03,"", "35"],
        "w40" :[ 5.39,"", "40"],
        "w45" :[ 5.78,"", "45"],
        "w50" :[ 6.15,"", "50"],
        "w55" :[ 6.55,"", "55"],
        "w60" :[ 6.94,"", "60"],
        "w65" :[ 7.33,"", "65"],
        "w70" :[ 7.70,"", "70"],
        "w75" :[ 8.10,"", "75"],
        "w80" :[ 8.49,"", "80"],
        "w85" :[ 8.86,"", "85"],
        "w90" :[ 9.24,"", "90"],
        "w95" :[ 9.63,"", "95"],
        "w100" : [10.00,"", "100"],
        "w105" : [10.40,"", "105"],
        "w110" : [10.79,"", "110"],
        "w115" : [11.18,"", "115"],
        "w120" : [11.56,"", "120"],
        "w125" :[ 11.95,"", "125"],
        "w130" :[ 12.32,"", "130"],
      }
    },
    {
      "name" : "NATURA",
      "width" : {
        "w35" : [5.03,"", "35"],
        "w40" :[ 5.39,"", "40"],
        "w45" :[ 5.78,"", "45"],
        "w50" :[ 6.15,"", "50"],
        "w55" :[ 6.55,"", "55"],
        "w60" :[ 6.94,"", "60"],
        "w65" :[ 7.33,"", "65"],
        "w70" :[ 7.70,"", "70"],
        "w75" :[ 8.10,"", "75"],
        "w80" :[ 8.49,"", "80"],
        "w85" :[ 8.86,"", "85"],
        "w90" :[ 9.24,"", "90"],
        "w95" :[ 9.63,"", "95"],
        "w100" : [10.00,"", "100"],
        "w105" : [10.40,"", "105"],
        "w110" : [10.79,"", "110"],
        "w115" : [11.18,"", "115"],
        "w120" : [11.56,"", "120"],
        "w125" :[ 11.95,"", "125"],
        "w130" :[ 12.32,"", "130"],
      }
    }

  ],

  // горизонтальные жалюзи

  horizontalHouverVenus : [
  {
    "name" : "Белые",
    "standard25mm" : [16.0  ,"", "25мм Стандарт"],
    "fullDimmer25mm" : [ 17.0 ,"", "25мм Полн. Затемн."],
    "standard16mm" :  [ 19.5,"",  "16мм Стандарт"],
  },
  {
    "name" : "Разноцветные",
    "standard25mm" : [17.5 ,"", "25мм Стандарт"],
    "fullDimmer25mm" : [18.5 ,"", "25мм Полн. Затемн."],
    "standard16mm" :  [21.0 ,"", "16мм Стандарт"],
  },
  {
    "name" : "Разноцветные",
    "standard25mm" : [17.5 ,"", "25мм Стандарт"],
    "fullDimmer25mm" : [18.5 ,"", "25мм Полн. Затемн."],
    "standard16mm" :  [21.0 ,"", "16мм Стандарт"],
  }
],

  horizontalHouverStandard : [
  {
    "name" : "Белые",
    "standard25mm" : [5.0  ,"", "25мм"],
    "standard16mm" :  [ 9.7,"",  "16мм"],
  },
  {
    "name" : "Разноцветные",
    "standard25mm" : [7.2 ,"", "25мм"],
    "standard16mm" :  [10.5 ,"", "16мм"],
  },
  {
    "name" : "Разноцветные",
    "standard25mm" : [7.2 ,"", "25мм"],
    "standard16mm" :  [10.5 ,"", "16мм"],
  }
],

//вертикальные жалюзи
verticalHouver89mm : [
 
   {
    "name" : "Line 89",
    "colorСode" : ["" , "601" , "" ],
    "price" : [7.5 , "", ""]
  },
   {
    "name" : "Line 89",
    "colorСode" : ["" , "601" , "" ],
    "price" : [7.5 , "", ""]
  },
],


  verticalHouver127mm : [
  {
    "name" : "Gamma 1100",
    "colorСode" : ["" , "1100" , "" ],
    "price" : [5.9 , "", ""]
  },
   {
    "name" : "LINE",
    "colorСode" : ["" , "8001, 8002, 8003, 8004" , "" ],
    "price" : [6.4 , "", ""]
  },
   {
    "name" : "LINE",
    "colorСode" : ["" , "8001, 8002, 8003, 8004" , "" ],
    "price" : [6.4 , "", ""]
  },
],

// новая вертикальная таблица
newVertical89 : [
  {
    "name" : "Line 2 89",
    "colorCodesName" :[ "601, 602, 605, 611 ,608, 633, ,614, 615, 623, 624, 622, 619, 617, 616, 1307", "", ""],
    "price" : [7.3, "", ""],
    "colorСode" : [601,602,605,611,608,633,603,614,615,623,624,622,619,617,616,1307],
  },
  {
    "name" : "Line 89",
    "colorCodesName" :[ "6001, 6002, 6003, 6004, 6005, 6006, 6007","",""],
    "price" : [7.5, "", ""],
    "colorСode" : [6001,6002,6003,6004,6005,6006,6007],
  },
],

newVertical127 : [
  {
    "name" : "Line 127",
    "colorCodesName" :[ "601, 602, 605, 611, 608, 633, 603, 614, 615, 623, 624, 622, 619, 617, 616, 1307", "", ""],
    "price" : [11, "", ""],
    "colorСode" : [601,602,605,611,608,633,603,614,615,623,624,622,619,617,616,1307],
  },
  {
    "name" : "127 Line 89",
    "colorCodesName" :[ "6001 ,6002, 6003, 6004, 6005, 6006, 6007","",""],
    "price" : [17, "", ""],
    "colorСode" : [6001,6002,6003,6004,6005,6006,6007],
  },
],

//Москитные сетки

 mosquitoNet : [
  {
    "name" : "Б-Белые, К-Коричневые, Д-Ламинация под дерево, А-Анодированые",
    "BK37" : [42.0 ,"", "37 Б / К"],
    "BK41" : [47.0,"",  "41 Б / К"],
    "DA37" : [66.0,"",  "37 Д / А"],
    "DA41" : [88.0,"",  "41 Д / А"]
  }
]




}